SELECT *
FROM `комерційний банк`
WHERE `банк id` = 2;

SELECT *
FROM `реквізити`
WHERE `сума` > 50000;

SELECT *
FROM `реквізити`
WHERE `сума` > 50000 AND `дата` > '2022-06-06';

SELECT *
FROM `реквізити`
WHERE `сума` > 50000 OR `дата` > '2022-06-06';

SELECT *
FROM `реквізити`
WHERE NOT `сума` > 50000;

SELECT *
FROM `реквізити`
WHERE NOT `сума` > 50000 AND `дата` > '2022-06-06';

SELECT `кошторис id`, `ліміт витрат`, `витрачена сума`
FROM `кошторис`
WHERE `витрачена сума` / 2 <= 1000000;

SELECT `кошторис id`, `ліміт витрат`, `витрачена сума`,
       `ліміт витрат` - `витрачена сума` AS 'залишок'
FROM `кошторис`;

SELECT *
FROM `бюджетна установа`
WHERE `бюджетна установа id` IN (2, 4, 8, 9);

SELECT *
FROM `бюджетна установа`
WHERE `бюджетна установа id` BETWEEN 2 AND 8;

SELECT *
FROM `казначейство`
WHERE `територіальна належність` LIKE '%na%';

SELECT *
FROM `комерційний банк`
WHERE `єдрпоу` IS NOT NULL;

-- частина 2 --

SELECT `територіальна належність`, `б у`.адреса, `б у`.назва
FROM `казначейство` `к`
JOIN `бюджетна установа` `б у` on `к`.`казначейство id` = `б у`.`казначейство id`;

SELECT kk.`кошторис id`, kk.призначення, kk.рік
FROM (SELECT `кекв`.`призначення`, кекв.`кошторис id`, `кошторис`.`рік`
      FROM `кошторис`, `кекв`
      WHERE кекв.`кошторис id` = кошторис.`кошторис id`) AS kk
ORDER BY kk.`кошторис id`;

SELECT *
FROM `комерційний банк`
WHERE EXISTS(
    SELECT *
    FROM `казначейство-банк`
    WHERE `банк id`=`комерційний банк`.`банк id` AND `казначейство id` = 2
          );

SELECT *
FROM `кошторис`
WHERE `кошторис id` IN (
    SELECT `кошторис id`
    FROM `затверджений кошторис`
    );

SELECT *
FROM казначейство
CROSS JOIN `бюджетна установа`;

SELECT pd.`доручення id`, pd.`затверджений казначейством`, r.дата, r.сума, r.номер, r.отримувач, r.підстава
FROM `платіжне доручення` pd
JOIN `реквізити` r on r.`реквізити id` = pd.`реквізити id`;

SELECT pd.`доручення id`, pd.`затверджений казначейством`, r.дата, r.сума, r.номер, r.отримувач, r.підстава
FROM `платіжне доручення` pd
JOIN `реквізити` r on r.`реквізити id` = pd.`реквізити id` AND r.сума > (SELECT AVG(сума) FROM реквізити);

SELECT б.`банк id`, `назва` AS 'назва банку', `єдрпоу`, `територіальна належність`
FROM `комерційний банк` б
INNER JOIN `казначейство-банк` `к-б` on б.`банк id` = `к-б`.`банк id`
INNER JOIN казначейство к on `к-б`.`казначейство id` = к.`казначейство id`;

SELECT б.`банк id`, `назва` AS 'назва банку', `єдрпоу`, `територіальна належність`
FROM `комерційний банк` б
LEFT OUTER JOIN `казначейство-банк` `к-б` on б.`банк id` = `к-б`.`банк id`
LEFT OUTER JOIN казначейство к on `к-б`.`казначейство id` = к.`казначейство id`;

SELECT б.`банк id`, `назва` AS 'назва банку', `єдрпоу`, `територіальна належність`
FROM `комерційний банк` б
RIGHT OUTER JOIN `казначейство-банк` `к-б` on б.`банк id` = `к-б`.`банк id`
RIGHT OUTER JOIN казначейство к on `к-б`.`казначейство id` = к.`казначейство id`;

SELECT `банк id` AS 'id закладу', `назва`
FROM `комерційний банк`
UNION (
    SELECT `бюджетна установа id`, `назва`
    FROM `бюджетна установа`
);